app/controllers/api/activities_controller.rb

SELECT "activities".* FROM "activities"
---
  def index
    # if params.has_key?(:user_id)
    #   debugger
    #   # @activities = Activity.find_by(user_id: params[:user_id])
    #   @activities = Activity.where(user_id: params[:user_id])
    #         render :index

        # else
            @activities = Activity.all

SELECT  "activities".* FROM "activities" WHERE "activities"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @activity = Activity.find(params[:id])

INSERT INTO "activities" ("user_id", "activity_type", "duration", "date", "time", "description", "created_at", "updated_at", "distance", "calories") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"
---
  def create
    @activity = Activity.new(activity_params)
    if @activity.save

SELECT  "activities".* FROM "activities" WHERE "activities"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]
UPDATE "activities" SET "distance" = $1, "date" = $2, "updated_at" = $3 WHERE "activities"."id" = $4  [["distance", 6.35], ["date", "Sun Dec 12 2021 18:11:23 GMT-0500 (Eastern Standard Time)"], ["updated_at", "2021-12-12 23:12:39.744252"], ["id", 10]]
---
  def update
    debugger
    @activity = Activity.find(params[:id])

    if @activity.update(activity_params)