app/controllers/api/comments_controller.rb

SELECT  "activities".* FROM "activities" WHERE "activities"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
---
    def destroy
        @activity = Activity.find(params[:activity_id])