app/controllers/api/comments_controller.rb

    def create
        @activity = Activity.find(params[:activity_id])
        @comment = @activity.comments.create(params[:comment].permit(:activity_id, :person_id, :body))
---
SELECT  "activities".* FROM "activities" WHERE "activities"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]
INSERT INTO "comments" ("activity_id", "body", "created_at", "updated_at", "person_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["activity_id", 8], ["body", "Testing comment"], ["created_at", "2021-12-11 03:08:00.094583"], ["updated_at", "2021-12-11 03:08:00.094583"], ["person_id", 1]]

    def index
        @activity = Activity.find(params[:activity_id])
        @comments = Comment.all
---
SELECT  "activities".* FROM "activities" WHERE "activities"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "comments".* FROM "comments"