app/controllers/api/likes_controller.rb

SELECT "likes".* FROM "likes"
---
    def index
      @likes = Like.all